module.exports = {
  content: ['./src/**/*.{vue,js}', './public/index.html'],
  theme: {
    extend: {
      backgroundImage: (theme) => ({
        'gradient-colors-1': ' linear-gradient(180deg, #DFF5FF 0%, #FFFFFF 100%);',
      }),
      colors: {
        black: {
          1: '#041721',
          2: '#1E1E1F',
          3: '#061120',
        },
        secondary: '#F09',
        primary: '#24f7fe',
        accent: '#8f74a5',
        'dark-accent': '#5f4773',
        neutral: 'rgba(255,255,255,0.8)',
        "extra-accent": '#8a7e94',
      },
      fontSize: {
        10: ['10px', '14px'],
        12: ['12px', '16px'],
        13: ['13px', '140%'],
        14: ['14px', '18px'],
        15: ['15px', '140%'],
        16: ['16px', '140%'],
        17: ['17px', '140%'],
        18: ['18px', '24px'],
        19: ['19px', '140%'],
        20: ['20px', '140%'],
        22: ['22px', '22px'],
        24: ['24px', '24px'],
        28: ['28px', '110%'],
        32: ['32px', '32px'],
        36: ['36px', '36px'],
      },
      fontWeight: {
        400: 400,
        500: 500,
        600: 600,
        700: 700,
        800: 800,
      },
      borderRadius: {
        sm:'10px',
        md:'20px',
        lg:'20px',
        xl:'20px',
        4: '4px',
        8: '8px',
        9: '9px',
        10: '10px',
        16: '16px',
        20: '20px',
        21: '21px',
      },
      fontFamily: {
        RubikGlitch: ['RubikGlitch-Regular'],
        alloyInk: ['LCD2B'],
        cherryBombOne: ['CherryBombOne'],
        titanOne: ['TitanOne-Regular'],
        sans: [
          'Roboto',
        ],
      },
      spacing: {
        '1': '1px',  // 添加自定义的 10px 间距
        '2': '2px',  // 添加自定义的 10px 间距
        '3': '3px',  // 添加自定义的 10px 间距
        '4': '4px',  // 添加自定义的 10px 间距
        '5': '5px',  // 添加自定义的 10px 间距
        '6': '6px',  // 添加自定义的 10px 间距
        '7': '7px',  // 添加自定义的 10px 间距
        '8': '8px',  // 添加自定义的 10px 间距
        '9': '9px',  // 添加自定义的 10px 间距
        '10': '10px',  // 添加自定义的 10px 间距
        '11': '10px',  // 添加自定义的 10px 间距
        '12': '12px',  // 添加自定义的 10px 间距
        '13': '13px',  // 添加自定义的 10px 间距
        '14': '14px',  // 添加自定义的 10px 间距
        '15': '15px',  // 添加自定义的 10px 间距
        '16': '16px',  // 添加自定义的 10px 间距
        '17': '17px',  // 添加自定义的 10px 间距
        '18': '18px',  // 添加自定义的 10px 间距
        '19': '19px',  // 添加自定义的 10px 间距
        '20': '20px',  // 添加自定义的 10px 间距
        '21': '21px',  // 添加自定义的 10px 间距
        '22': '22px',  // 添加自定义的 10px 间距
        '23': '23px',  // 添加自定义的 10px 间距
        '24': '24px',  // 添加自定义的 10px 间距
        '25': '25px',  // 添加自定义的 10px 间距
        '26': '26px',  // 添加自定义的 10px 间距
        '27': '27px',  // 添加自定义的 10px 间距
        '28': '28px',  // 添加自定义的 10px 间距
        '29': '29px',  // 添加自定义的 10px 间距
        '30': '30px',  // 添加自定义的 10px 间距
        '31': '31px',  // 添加自定义的 10px 间距
        '32': '32px',  // 添加自定义的 10px 间距
        '33': '33px',  // 添加自定义的 10px 间距
        '34': '34px',  // 添加自定义的 10px 间距
        '35': '35px',  // 添加自定义的 10px 间距
        '36': '36px',  // 添加自定义的 10px 间距
        '37': '37px',  // 添加自定义的 10px 间距
        '38': '38px',  // 添加自定义的 10px 间距
        '40': '40px',  // 添加自定义的 10px 间距
        '42': '42px',  // 添加自定义的 10px 间距
        '44': '44px',  // 添加自定义的 10px 间距
        '45': '45px',  // 添加自定义的 10px 间距
        '46': '46px',  // 添加自定义的 10px 间距
        '47': '47px',  // 添加自定义的 10px 间距
        '48': '48px',  // 添加自定义的 10px 间距
        '50': '50px',  // 添加自定义的 10px 间距
        '54': '54px',  // 添加自定义的 10px 间距
        '63': '63px',  // 添加自定义的 10px 间距
        '73': '73px',  // 添加自定义的 10px 间距
      },
    },
  },
  variants: {
    extend: {},
  },
  plugins: [],
};
